"""
3. По введенным пользователем координатам двух точек вывести уравнение прямой вида y=kx+b, проходящей через эти точки.
"""

"""
y = kx + b
y = (y2 - y1 / x2 - x1)x + y1

k = AC / BC

AC = y2 - y1
BC = x2 - x1

k = y2 - y1 / x2 - x1
"""

"""
Найти уравнение прямой проходящей через две точки M(1, 7) и N(2, 3).
x - x1 / x2 - x1 = y - y1 / y2 - y1
x - 1  / 2 - 1   = y - 7  /  3 - 7

Упростив это уравнение получим каноническое уравнение прямой
x - 1 / 1  =  y - 7 / -4

y - 7 / -4 = x - 1 / 1
 
y = -4 (x - 1 )  +  7  +4 


Выразим y через x и получим уравнение прямой с угловым коэффициентом
y - 7 = -4(x - 1)
y = -4x + 11


"""